Спортклуб/src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Поставщики</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоступления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Спортклуб/src/InformationRegisters/ЦенаТовара/ЦенаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦенаТовара</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Товары</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Спортклуб/src/Documents/ПриходТовара/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Количество = Элементы.Товары.ТекущиеДанные.Количество;
	Цена = Элементы.Товары.ТекущиеДанные.ЦенаПоступления;
	Элементы.Товары.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦену(Товар, Дата)
	Отбор = Новый Структура("Товар", Товар);
	ЦенаТовара = РегистрыСведений.ЦенаТовара.ПолучитьПоследнее(Дата, Отбор);	
	Возврат ЦенаТовара.Цена 
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Товар = Элементы.Товары.ТекущиеДанные.Товар;
	Цена = ПолучитьЦену(Товар, Объект.Дата);
	Элементы.Товары.ТекущиеДанные.ЦенаПоступления = Цена;
	Количество = Элементы.Товары.ТекущиеДанные.Количество;
	Элементы.Товары.ТекущиеДанные.Сумма = Цена * Количество;
КонецПроцедуры
